class Country < ActiveRecord::Base
  has_many :stations
  has_many :railways

  def code    
#    АЗ — 57
#     БЧ — 21
#     БДЖ — 52
#     ДСВН — 32
#     ГР — 28
#     КЗХ — 27
#     КЖД — 33
#     ЗЧ — 30
#     КРГ — 59
#     ЛДЗ — 25
#     ЛГ — 24
#     ЧФМ — 23
#     МТЗ — 31
#     ПКП — 51
#     РЖД — 20
#     ТДЖ — 66
#     ТРК — 67
#     УТИ — 29
#     УЗ — 22
#     ЭВР — 26
    {"АЗ"=>57,  "БЧ"=>21, "БДЖ"=>52, "ДСВН"=>32, "ГР"=>28, "КЗХ"=>27, 
     "КЖД"=>33, "ЗЧ"=>30, "КРГ"=>59, "ЛДЗ"=>25,  "ЛГ"=>24, "ЧФМ"=>23, 
     "МТЗ"=>31, "ПКП"=>51,"РЖД"=>20, "ТДЖ"=>66,  "ТРК"=>67,"УТИ"=>29, 
     "УЗ"=>22, "ЭВР"=>26}[self.short_name]
  end

#  def short_name
#    self.short_name.empty? ? self.name : self.short_name
#  end
end
